load-tests/sync-test.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: k6-sync-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 50 looping VUs for 30s (gracefulStop: 30s)


running (0m00.9s), 50/50 VUs, 400 complete and 0 interrupted iterations
default   [   3% ] 50 VUs  00.9s/30s

running (0m01.9s), 50/50 VUs, 850 complete and 0 interrupted iterations
default   [   6% ] 50 VUs  01.9s/30s

running (0m02.9s), 50/50 VUs, 1350 complete and 0 interrupted iterations
default   [  10% ] 50 VUs  02.9s/30s

running (0m03.9s), 50/50 VUs, 1818 complete and 0 interrupted iterations
default   [  13% ] 50 VUs  03.9s/30s

running (0m04.9s), 50/50 VUs, 2300 complete and 0 interrupted iterations
default   [  16% ] 50 VUs  04.9s/30s

running (0m05.9s), 50/50 VUs, 2800 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  05.9s/30s

running (0m06.9s), 50/50 VUs, 3250 complete and 0 interrupted iterations
default   [  23% ] 50 VUs  06.9s/30s

running (0m07.9s), 50/50 VUs, 3750 complete and 0 interrupted iterations
default   [  26% ] 50 VUs  07.9s/30s

running (0m08.9s), 50/50 VUs, 4200 complete and 0 interrupted iterations
default   [  30% ] 50 VUs  08.9s/30s

running (0m09.9s), 50/50 VUs, 4650 complete and 0 interrupted iterations
default   [  33% ] 50 VUs  09.9s/30s

running (0m10.9s), 50/50 VUs, 5100 complete and 0 interrupted iterations
default   [  36% ] 50 VUs  10.9s/30s

running (0m11.9s), 50/50 VUs, 5600 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  11.9s/30s

running (0m12.9s), 50/50 VUs, 6050 complete and 0 interrupted iterations
default   [  43% ] 50 VUs  12.9s/30s

running (0m13.9s), 50/50 VUs, 6503 complete and 0 interrupted iterations
default   [  46% ] 50 VUs  13.9s/30s

running (0m14.9s), 50/50 VUs, 7000 complete and 0 interrupted iterations
default   [  50% ] 50 VUs  14.9s/30s

running (0m15.9s), 50/50 VUs, 7450 complete and 0 interrupted iterations
default   [  53% ] 50 VUs  15.9s/30s

running (0m16.9s), 50/50 VUs, 7950 complete and 0 interrupted iterations
default   [  56% ] 50 VUs  16.9s/30s

running (0m17.9s), 50/50 VUs, 8421 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  17.9s/30s

running (0m18.9s), 50/50 VUs, 8900 complete and 0 interrupted iterations
default   [  63% ] 50 VUs  18.9s/30s

running (0m19.9s), 50/50 VUs, 9350 complete and 0 interrupted iterations
default   [  66% ] 50 VUs  19.9s/30s

running (0m20.9s), 50/50 VUs, 9850 complete and 0 interrupted iterations
default   [  70% ] 50 VUs  20.9s/30s

running (0m21.9s), 50/50 VUs, 10300 complete and 0 interrupted iterations
default   [  73% ] 50 VUs  21.9s/30s

running (0m22.9s), 50/50 VUs, 10750 complete and 0 interrupted iterations
default   [  76% ] 50 VUs  22.9s/30s

running (0m23.9s), 50/50 VUs, 11250 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  23.9s/30s

running (0m24.9s), 50/50 VUs, 11700 complete and 0 interrupted iterations
default   [  83% ] 50 VUs  24.9s/30s

running (0m25.9s), 50/50 VUs, 12150 complete and 0 interrupted iterations
default   [  86% ] 50 VUs  25.9s/30s

running (0m26.9s), 50/50 VUs, 12650 complete and 0 interrupted iterations
default   [  90% ] 50 VUs  26.9s/30s

running (0m27.9s), 50/50 VUs, 13100 complete and 0 interrupted iterations
default   [  93% ] 50 VUs  27.9s/30s

running (0m28.9s), 50/50 VUs, 13600 complete and 0 interrupted iterations
default   [  96% ] 50 VUs  28.9s/30s

running (0m29.9s), 50/50 VUs, 14050 complete and 0 interrupted iterations
default   [ 100% ] 50 VUs  29.9s/30s


  █ TOTAL RESULTS 

    checks_total.......: 28200  939.02007/s
    checks_succeeded...: 52.26% 14740 out of 28200
    checks_failed......: 47.73% 13460 out of 28200

    ✗ status is 201
      ↳  4% — ✓ 640 / ✗ 13460
    ✓ response time < 700ms

    CUSTOM
    errors.........................: 95.46%  13460 out of 14100
    latency........................: avg=5.77544 min=0.311    med=3.05     max=83.472  p(90)=10.9983  p(95)=20.82445
    success........................: 100.00% 640 out of 640

    HTTP
    http_req_duration..............: avg=5.77ms  min=311µs    med=3.05ms   max=83.47ms p(90)=10.99ms  p(95)=20.82ms 
      { expected_response:true }...: avg=41.06ms min=19.28ms  med=39.35ms  max=83.47ms p(90)=56.13ms  p(95)=71.18ms 
    http_req_failed................: 95.46%  13460 out of 14100
    http_reqs......................: 14100   469.510035/s

    EXECUTION
    iteration_duration.............: avg=106.4ms min=100.38ms med=103.61ms max=206.9ms p(90)=111.84ms p(95)=121.74ms
    iterations.....................: 14100   469.510035/s
    vus............................: 50      min=50             max=50
    vus_max........................: 50      min=50             max=50

    NETWORK
    data_received..................: 3.8 MB  128 kB/s
    data_sent......................: 5.6 MB  185 kB/s



running (0m30.0s), 00/50 VUs, 14100 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  30s